// 각 자리의 문자들의 숫자를 더한값! 이 순서다.

// A = 순서1
// AA = 순서2
// AAA = 순서3
// AAAA = 순서4
// AAAAA = 순서5
// AAAAE = 순서6

// A E I O U 

// A        1 1             1
// AA       1 1             2
// AAA      1 1 1           3
// AAAA     1 1 1 1         4

// AAAAA    1 1 1 1 1       5
// AAAAE    1 1 1 1 2       6       
// AAAAI    1 1 1 1 3       7 
// AAAAO    1 1 1 1 4       8 
// AAAAU    1 1 1 1 5       9

// AAAE     1 1 1 7         10
// AAAEA    1 1 1 7 1       11
// AAAEE    1 1 1 7 2       12
// AAAEI    1 1 1 7 3       13
// AAAEO    1 1 1 7 4       14
// AAAEU    1 1 1 7 5       15

// AAAI     1 1 1 13        16


// AAAU     1 1 1 25        28   
// AAAUA    1 1 1 25 1      29   
// AAAUE    1 1 1 25 2      30   
// AAAUI    1 1 1 25 3      31   
// AAAUO    1 1 1 25 4      32   
// AAAUU    1 1 1 25 5      33

// AAE      1 1 32          34
// AAUUU    1 1 125 25 5    157

// AE       1 157           158
// AUUUU    1 625 126 25 5  781
// E                        782


/* 
마지막자리
A : 1
E : 2
I : 3
O : 4
U : 5

네번째자리 (6씩)
A : 1
E : 7
I : 13
O : 19
U : 25

세번째자리 (31씩)
A : 1
E : 31
I : 63
O : 94
U : 125

두번째자리 (156씩)
A : 1
E : 157
I : 313
O : 469
U : 625

첫번째자리 (781씩)
A : 1
E : 782
I : 1563
O : 2344
U : 3125
*/
